#### BuiltInFailures.StructuralConnectionFailures Members

---

|  |
| --- |
| BuiltInFailures StructuralConnectionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures StructuralConnectionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | StructuralConnectionCannotGenerate | Could not create Structural Connection Handler |
| Public property Static member | StructuralConnectionCannotReplaceRefs | Structural Connection cannot replace elements |
| Public property Static member | StructuralConnectionForbiddenElementInGroup | Fabrication element can not be a group member. |
| Public property Static member | StructuralConnectionNoSingleRef | Summary: Structural Connection Handler lost connected element. |
| Public property Static member | StructuralConnectionNotEnoughRefs | Structural Connection Handler cannot connect fewer than two elements. |
| Public property Static member | StructuralConnectionSetOfRefsChanged | The set of input elements was changed and the connection has been adjusted. |
| Public property Static member | StructuralConnectionTooFarNotEnoughRefs | Structural Connection Handler cannot connect too far elements |
| Public property Static member | StructuralConnectionTooFarRefs | Structural Connection Handler cannot connect too far elements |
| Public property Static member | StructuralConnectionTypeChangedToGeneric | Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'. |
| Public property Static member | StructuralConnectionTypeInfoNotAvailable | There is no add-on installed which supports Structural Connection type. |
| Public property Static member | StructuralConnectionWrongType | Structural Connection has an inappropriate type assigned. |
| Public property Static member | StructuralSectionHasIncompleteDefinition | Structural Section has incomplete definition |

# See Also

BuiltInFailures StructuralConnectionFailures Class

Autodesk.Revit.DB Namespace